app/controllers/api/v1/comments_controller.rb

INSERT INTO "comments" ("title", "body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Amazing"], ["body", "Once in a lifetime."], ["post_id", 4], ["created_at", "2024-01-14 08:41:56.032419"], ["updated_at", "2024-01-14 08:41:56.032419"]]
---
      def create
        comment = Comment.new(comment_params)

        if comment.save