app/controllers/api/v1/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."slug" = $1 LIMIT $2  [["slug", "orchard-road-christmas-celebrations"], ["LIMIT", 1]]
---
      def show
        post = Post.find_by(slug: params[:slug])

INSERT INTO "posts" ("title", "body", "slug", "created_at", "updated_at", "category") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "How to get fit"], ["body", nil], ["slug", "how-to-get-fit"], ["created_at", "2024-01-14 08:32:07.943273"], ["updated_at", "2024-01-14 08:32:07.943273"], ["category", nil]]
---
      def create
        post = Post.new(post_params)

        if post.save

SELECT "posts".* FROM "posts" WHERE "posts"."slug" = $1 LIMIT $2  [["slug", "how-to-grow-a-plant"], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "other fake post"], ["updated_at", "2024-01-14 08:38:20.272806"], ["id", 3]]
---
      def update
        post = Post.find_by(slug: params[:slug])

        if post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."slug" = $1 LIMIT $2  [["slug", "how-to-get-fit"], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 10]]
---
      def destroy
        post = Post.find_by(slug: params[:slug])

        if post.destroy